# FullStepArrow Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
StairsPathType..::..FullStepArrow Property
StairsPathType Class See Also
---
True if the arrow fills the full step width, false if it fills by the specified arrow size.
**Namespace:** Autodesk.Revit.DB.Architecture**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool FullStepArrow { get; set; }
```

Visual Basic
---
```text
Public Property FullStepArrow As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool FullStepArrow {
	bool get ();
	void set (bool value);
}
```

# See Also
StairsPathType Class
Autodesk.Revit.DB.Architecture Namespace